## [ethanhassett](https://hassettio.app.spacelift.io/stack/ethanhassett/run/01J9HQB3W73673EBQW1QBCPX52) plan logs

<details>
<summary>Click here to expand</summary>

```
[01J9C189FNGT0S8ZE53S3QGFF6] Planning changes with 0 custom hooks...
data.hcp_vault_secrets_secret.cloudflare_api_token: Reading...
data.hcp_vault_secrets_secret.google_credentials: Reading...
data.hcp_vault_secrets_secret.google_credentials: Read complete after 0s [id=spacelift]
data.hcp_vault_secrets_secret.cloudflare_api_token: Read complete after 0s [id=spacelift]
data.cloudflare_zone.this: Reading...
google_service_account.cloud_run: Refreshing state... [id=projects/ethanhassett/serviceAccounts/cloudrun@ethanhassett.iam.gserviceaccount.com]
google_project_iam_binding.service_account_user: Refreshing state... [id=ethanhassett/roles/iam.serviceAccountUser]
google_project_iam_binding.cloud_run_admin: Refreshing state... [id=ethanhassett/roles/run.admin]
google_cloud_run_v2_service.this: Refreshing state... [id=projects/ethanhassett/locations/us-east1/services/ethanhassett]
data.cloudflare_zone.this: Read complete after 1s [id=f96446d78e054da3fe5c6ace7557f782]
google_cloud_run_service_iam_binding.this: Refreshing state... [id=v1/projects/ethanhassett/locations/us-east1/services/ethanhassett/roles/run.invoker]
google_cloud_run_domain_mapping.this: Refreshing state... [id=locations/us-east1/namespaces/ethanhassett/domainmappings/ethanhassett.com]
cloudflare_record.this["3"]: Refreshing state... [id=ac5b87486600c02641153ba9840eb28d]
cloudflare_record.this["4"]: Refreshing state... [id=f1c76da2b4b9705c3f5897f372c717f4]
cloudflare_record.this["6"]: Refreshing state... [id=75d78350d8439bfe3f3472420f41a72e]
cloudflare_record.this["5"]: Refreshing state... [id=ca347d6c1d1cce3a7e4932e8ade94bdf]
cloudflare_record.this["0"]: Refreshing state... [id=bacd1a05fe398a56b421ed113e33cd7d]
cloudflare_record.this["7"]: Refreshing state... [id=8294b351eb031747e8318087b1d7cf4e]
cloudflare_record.this["2"]: Refreshing state... [id=0ba33e955934a05cc8a6b2efbff7a36e]
cloudflare_record.this["1"]: Refreshing state... [id=d8d3a7edcfa34a18a4f0f97ef6512aef]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # cloudflare_record.www["0"] will be created
  + resource "cloudflare_record" "www" {
      + allow_overwrite = false
      + content         = "216.239.32.21"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "www"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "f96446d78e054da3fe5c6ace7557f782"
    }

  # cloudflare_record.www["1"] will be created
  + resource "cloudflare_record" "www" {
      + allow_overwrite = false
      + content         = "216.239.34.21"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "www"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "f96446d78e054da3fe5c6ace7557f782"
    }

  # cloudflare_record.www["2"] will be created
  + resource "cloudflare_record" "www" {
      + allow_overwrite = false
      + content         = "216.239.36.21"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "www"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "f96446d78e054da3fe5c6ace7557f782"
    }

  # cloudflare_record.www["3"] will be created
  + resource "cloudflare_record" "www" {
      + allow_overwrite = false
      + content         = "216.239.38.21"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "www"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "f96446d78e054da3fe5c6ace7557f782"
    }

  # cloudflare_record.www["4"] will be created
  + resource "cloudflare_record" "www" {
      + allow_overwrite = false
      + content         = "2001:4860:4802:32::15"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "www"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "AAAA"
      + value           = (known after apply)
      + zone_id         = "f96446d78e054da3fe5c6ace7557f782"
    }

  # cloudflare_record.www["5"] will be created
  + resource "cloudflare_record" "www" {
      + allow_overwrite = false
      + content         = "2001:4860:4802:34::15"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "www"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "AAAA"
      + value           = (known after apply)
      + zone_id         = "f96446d78e054da3fe5c6ace7557f782"
    }

  # cloudflare_record.www["6"] will be created
  + resource "cloudflare_record" "www" {
      + allow_overwrite = false
      + content         = "2001:4860:4802:36::15"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "www"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "AAAA"
      + value           = (known after apply)
      + zone_id         = "f96446d78e054da3fe5c6ace7557f782"
    }

  # cloudflare_record.www["7"] will be created
  + resource "cloudflare_record" "www" {
      + allow_overwrite = false
      + content         = "2001:4860:4802:38::15"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "www"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "AAAA"
      + value           = (known after apply)
      + zone_id         = "f96446d78e054da3fe5c6ace7557f782"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

[01J9C189FNGT0S8ZE53S3QGFF6] Changes are GO
[01J9C189FNGT0S8ZE53S3QGFF6] Uploading the list of managed resources...
[01J9C189FNGT0S8ZE53S3QGFF6] Please be aware that the run changes calculation includes output changes.
[01J9C189FNGT0S8ZE53S3QGFF6] Resource list upload is GO
[01J9C189FNGT0S8ZE53S3QGFF6] Generating JSON representation of the plan...
[01J9C189FNGT0S8ZE53S3QGFF6] JSON representation is GO
[01J9C189FNGT0S8ZE53S3QGFF6] Loading custom plan policy inputs...
[01J9C189FNGT0S8ZE53S3QGFF6] 0 custom plan policy inputs found
[01J9C189FNGT0S8ZE53S3QGFF6] No plan policies to evaluate
```

</details>